# 1.Напиши функцию которая будет выводить «что-нибудь » при вызове
# 2.Напиши функцию которая будет выводить число которое ей задали в аргументе
# 3.Напиши функцию которая будет вызывать сама себя пока аргумент в ней не будет равен нулю,
# и каждую итерацию когда аргумент больше нуля вычитать из него 1
# 4.Напиши функцию которая будет брать строку и выводить каждый символ раз в секунду в терминал
# 5.Напиши функцию которая будет брать два числа и выводить матрицу из «Х» 20 на 20 символов и ставить
# «0» в той координате которая дана в виде двух чисел на входе



# №1
# def foxy_uwu():
#     print("что-нибудь")
#
#
# foxy_uwu()
# # №2
# def foxy_uwu(n):
#     print(n)
# foxy_uwu(50)

# №3
#
# def factorial_recursive(n):
#     if n == 0:
#         return n
#     else:
#         return factorial_recursive(n-1)
# print(factorial_recursive(10))
#N4
# from time import sleep
# def fox_uwu(n):
#     cur = 0
#     while cur <= len(n):
#         print(n[cur])
#         sleep(1)
#         cur+=1
# print(fox_uwu("SprintFoxYiff"))

# i = 1
# while i <= 10:
#     print(i ** 2)
#     i += 1


# --- факториял
# # вычислим 3!
# res = 1
# for i in range(1, 4):
#     res *= i
# print(res)
#
# # вычислим 5!
# res = 1
# for i in range(1, 6):
#     res *= i
# print(res)

